In [2]:
import pandas as pd

frame = pd.read_csv("..\students.csv")
print(frame.head(1))

   StudentID FirstName LastName  Grade                      Email Enrolled  \
0       1001     Alice  Johnson     10  alice.johnson@example.com      Yes

   MathScore  ScienceScore
0       88.8          92.4

In [3]:
print(frame.shape)

(8, 8)

In [15]:
def total(row):
    return row["MathScore"]+row["ScienceScore"]

frame["TotalScore"] = frame.apply(total, axis=1)
print(frame)

   StudentID FirstName  LastName  Grade                       Email Enrolled  \
0       1001     Alice   Johnson     10   alice.johnson@example.com      Yes
1       1002       Bob     Smith     11       bob.smith@example.com      Yes
2       1003   Charlie  Williams     10     charlie.lee@example.com       No
3       1004     Diana    Garcia     12    diana.garcia@example.com      Yes
4       1005     Ethan  Martinez      9  ethan.martinez@example.com      Yes
5       1006     Fiona  Williams     11  fiona.williams@example.com       No
6       1007     Zeeja     Davis     12    george.brown@example.com      Yes
7       1008    Hannah     Davis      9    hannah.davis@example.com      Yes

   MathScore  ScienceScore  total  TotalScore
0       88.8          92.4  181.2       181.2
1       75.2          85.0  160.2       160.2
2       90.9          78.0  168.9       168.9
3       95.0          89.0  184.0       184.0
4       82.0          84.0  166.0       166.0
5       70.0          73.0  143.0       143.0
6       88.0          91.0  179.0       179.0
7       93.0          90.0  183.0       183.0

In [19]:
frame.groupby(by="Grade")["TotalScore"].agg(["max","min","mean"])

         max    min    mean
Grade
9      183.0  166.0  174.50
10     181.2  168.9  175.05
11     160.2  143.0  151.60
12     184.0  179.0  181.50

In [21]:
frame[["MathScore","ScienceScore"]].apply(pd.Series.round)

   MathScore  ScienceScore
0       89.0          92.0
1       75.0          85.0
2       91.0          78.0
3       95.0          89.0
4       82.0          84.0
5       70.0          73.0
6       88.0          91.0
7       93.0          90.0